models/rbac/AuthMenu.php

SELECT `id`, `name`, `description`, `sort`, `display`, `icon` FROM `auth_menu` WHERE (`parent_id`=0) AND (`display`=1) ORDER BY `sort`
SELECT `id`, `name`, `description`, `sort`, `display`, `icon` FROM `auth_menu` WHERE (`parent_id`='79') AND (`display`=1) ORDER BY `sort`, `display` DESC
SELECT `id`, `name`, `description`, `sort`, `display`, `icon` FROM `auth_menu` WHERE (`parent_id`='87') AND (`display`=1) ORDER BY `sort`, `display` DESC
---
    public function getMenusAll($display = NULL) {
        $query = $this->find()->select(['id', 'name', 'description', 'sort', 'display', 'icon']);
        $query->andWhere(['parent_id' => 0]);
        if ($display) {
            $query->andWhere(['display' => $display]);
        }
        $list = $query->orderBy('sort')->asArray()->all();

        foreach ($list as $key => $val) {
            // 获取二级菜单
            $query2 = $this->find()->select(['id', 'name', 'description', 'sort', 'display', 'icon']);
            $query2->andWhere(['parent_id' => $val['id']]);
            if ($display) {
                $query2->andWhere(['display' => $display]);
            }
            $list2 = $query2->orderBy('sort asc, display desc')->asArray()->all();

            // 获取三级菜单
            foreach ($list2 as $key2 => $val2) {
                $query3 = $this->find()->select(['id', 'name', 'description', 'sort', 'display', 'icon']);
                $query3->andWhere(['parent_id' => $val2['id']]);
                if ($display) {
                    $query3->andWhere(['display' => $display]);
                }
                $list3 = $query3->orderBy('sort asc, display desc')->asArray()->all();