views/order/_form.php

        <div class="help-block"></div>
    </div>

    <?= $form->field($model, 'driverid',['options' => ['class' => 'col-lg-6'],'labelOptions' => ['class' => 'col-lg-3 control-label']])->dropDownList(\app\models\Driver::find()->select(['driver'])->indexBy('userid')->column(), ['prompt'=>'分配司机请选择']) ?>
---
SELECT `driver`, `userid` FROM `driver`

        <?=$model->addtime?>
        <div class="help-block"></div>
    </div>
    <?= $form->field($model, 'routeid',['options' => ['class' => 'col-lg-6'],'labelOptions' => ['class' => 'col-lg-3 control-label']])->dropDownList(\app\models\Route::find()->select(['CONCAT(saddr,eaddr)'])->indexBy('id')->column(), ['prompt'=>'请选择']) ?>
---
SELECT CONCAT(saddr,eaddr), `id` FROM `route`