views/order/_search.php

    ]); ?>


    <?php echo $form->field($model, 'routeid')->dropDownList(\app\models\Route::find()->select(['CONCAT(saddr,eaddr)'])->indexBy('id')->column(), ['prompt'=>'请选择']) ?>
---
SELECT CONCAT(saddr,eaddr), `id` FROM `route`