views/order/index.php

                'attribute' => 'userid',
                'value' => function($data)
                {
                    $route=\app\models\Users::findOne($data->userid);
---
SELECT * FROM `user` WHERE `id`='24'

                'attribute' => 'driverid',
                'value' => function($data)
                {
                    $route=\app\models\Users::findOne($data->driverid);
---
SELECT * FROM `user` WHERE `id`='0'

                'attribute' => 'routeid',
                'value' => function($data)
                {
                    $route=\app\models\Route::findOne($data->routeid);
---
SELECT * FROM `route` WHERE `id`='3'