views/order/view.php

        'attributes' => [
            'id',
            'orderid',
            [                      // the owner name of the model
                'attribute' => 'userid',
                'value' => function($data)
                {
                    $route=\app\models\Users::findOne($data->userid);
                    return $route->name;
                }
            ],
            [                      // the owner name of the model
                'attribute' => 'driverid',
                'value' => function($data)
                {
                    $route=\app\models\Users::findOne($data->driverid);
                    return $route->name;
                }
            ],
---
SELECT * FROM `user` WHERE `id`='24'
SELECT * FROM `user` WHERE `id`='0'

                'attribute' => 'routeid',
                'value' => function($data)
                {
                    $route=\app\models\Route::findOne($data->routeid);
---
SELECT * FROM `route` WHERE `id`='3'