controllers/RouteController.php

    protected function findModel($id)
    {
        if (($model = Route::findOne($id)) !== null) {
---
SELECT * FROM `route` WHERE `id`='3'